<!DOCTYPE html>
<html lang="en">
<head>

    {{--头文件--}}
    @include('admin.layout.head')
    {{--扩展的css文件--}}
    @yield('extendCss')


</head>

<body>
    @section('container')
    <div id="container" class="effect mainnav-lg">

        <!--顶部导航-->
        @include('admin.layout.top_navbar')
        <!--===================================================-->
        <!--END 顶部导航-->

        <div class="boxed">
            <!--CONTENT 主体内容-->
            <!--===================================================-->
            @yield('content')
            <!--===================================================-->
            <!--END CONTENT 主体内容-->

            <!--MAIN 左边导航-->
            <!--===================================================-->
            @include('admin.layout.Menu')
            <!--===================================================-->
            <!--END MAIN 左边导航-->

            <!--右边更多选项-->
            <!--===================================================-->
            @include('admin.layout.right_more_tab')
            <!--===================================================-->
            <!--END 右边更多选项-->
        </div>

        <!-- FOOTER -->
        <!--===================================================-->
        @include('admin.layout.footer')
        <!--===================================================-->
        <!-- END FOOTER -->

        <!-- SCROLL PAGE BUTTON -->
        <!--===================================================-->
        <button class="scroll-top btn">
            <i class="pci-chevron chevron-up"></i>
        </button>
        <!--===================================================-->
    </div>
    @show
    <!--===================================================-->
    <!-- END OF CONTAINER -->
</body>
{{--扩展的JS文件--}}
@yield('extendJs')
</html>
